bench_bnb_project/benchbnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hello"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "VmBAhD3lFL746vWDv75gMg"], ["updated_at", "2018-10-08 17:08:06.013661"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!