bench_bnb_project/benchbnb/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "qQfM6zKr1UnFP_P5P6duDg"], ["LIMIT", 1]]
---
  def current_user
     return nil unless session[:session_token]
      @current_user ||= User.find_by(session_token: session[:session_token])